{
    "raw_content": "“Data-Driven Catalyst”: Toolkit for on-chain and off-chain data analytics & insight, optimize governance and prevent gaming and abuse\nGo back to main project page.\nProject ID 1100299\nLink Open full project\nChallenge F11: Catalyst Systems Improvements: Discovery\nBudget ADA 175,000.00\nFunds distributed ADA 63,000.00\nStart date Mar 11, 2024\nMilestone 1\nMilestone 2\nMilestone 3\nMilestone 4\nFinal Milestone\nMilestone 1\nLatest submission of the Milestone 1.\nJump to Proof of Achievement\nMilestone submitted at March 3, 2024 at 2:39 AM\nMilestone Title Project outline, roadmap documentation and Catalyst Team feedback\nMilestone Outputs\nNote: Please note that some modifications have been done to the duration and funding percentages due to the timeline of the onboarding process and limitation of milestone numbers in the module. When it says \"May\", \"June\" etc. we generally mean the first day of the month and closer to it.\nThis milestone will lay the groundwork for a successful project roadmap involving stakeholders (like Catalyst team, community and Ada holders, dRep community or SPOs etc.). Discussion of stack choices, challenges and team roles.\n A dedicated Github repository and Gitbook document that already contains some structure, a roadmap and key deliverables\n Feedback from stakeholders and discussion of Catalyst Voices and Voltaire Roadmap integration\n Report about open source data science ecosystem relevant to this project\nInventory of known Catalyst projects and community contributions during previous funds we are aware of and interested parties can publicly contribute to.\nList of collaborators, volunteers and team members\nDocumentation that shares deliverables of “Data-Driven Catalyst” project with the broader community, to increase access beyond the Milestones Module, giving more discussion-style scope and allow feedback and iteration from feedback. This could be a Medium article and downloadable PDF linked from our Gitbook or similar format.\nUse cases, background and scope published on Gitbook\nDiscussion of recent AI “hype” and its possible impact on Catalyst (risks and opportunities)\n2\napprovals\n0\nrefusals\nOpen Milestone Outputs reviews\nAcceptance criteria\n Project repository, Roadmap document and all other outputs publicly accessible\nComprehensive nature of tech stack discussion covering at least 20 possible open source software packages\nGitbook and reports cover all relevant functionality, data compatibility issues, integration of Catalyst Voices innovation/changes and also cover open source data science ecosystem and recent development in Artificial Intelligence / LLM and their relevance to a data-driven Catalyst\nProject involves broad range of stakeholders like Catalyst Team, Ada holders, Cardano developers (freelance and funded project teams) and Community Reviewers community\nAI discussion covers multiple sources and centers on relevance for Project Catalyst improvement\nCatalyst stack change discussion (Voices, Hermes, & Community-driven) is up-to-date and comprehensive\nAll Data in use cases is shared in raw and cleaned form\n2\napprovals\n0\nrefusals\nOpen Acceptance criteria reviews\nEvidence of milestone completion\nGithub readme and PDF format roadmap and specification documents\nPublicly accessible URLs for repositories, Gitbook and social media channels\nVideos, notes, screenshots, reports outlining meetings that took place and feedback from collaborators\nUse case sample of “data-driven” Catalyst across more than one fund\nEvidence will be provided via public links and shared using our social media channels for the community to access.\n2\napprovals\n0\nrefusals\nOpen Evidence of milestone completion reviews\nDelivery Month 2 - May 2024\nMilestone Cost\n20.00%\n20.00%\nADA 35,000.00\nProject Completion\n20%\n20%\nSignoff\nApproved by Catalyst Team sign off user on: March 4, 2024 at 4:38 PM\nOpen active reviews for this Milestone\nProof of Achievement\nContent:\nThird submission of M1 POA. What is new in this submission:\nAdditional Google Drive link (Chats.pdf) with evidence of private chats and public Telegram channel posts\nIf this evidence is not sufficient please let us know in Discussion module or reach out on Telegram @tomwedler\nWorkshop with full video recording will be provided as part of Milestone-2, M1 is just setting the stage and did not have video recording of meetings as required evidence.\nThanks!\nWork on the project is on-going and publicly accessible and constant changes and improvements will happen to the repo.\nPlease find below Evidence as listed in the SOM for M1.\nTo give a better overview and due to the large amount of different, preliminary building blocks that lay the foundation for later milestones, we have recorded a video walk-through for the First Milestone in addition to other relevant publicly accessible documentation links below.\nhttps://drive.google.com/file/d/1y2VAuy0qIa45coFxFbv81mVeQfR_VZ4_/view?usp=sharing\nGithub landing page & Readme: https://github.com/Sapient-Predictive-Analytics/Data-Driven_Catalyst/\nRoadmap on Github: https://github.com/Sapient-Predictive-Analytics/Data-Driven_Catalyst/blob/main/Roadmap.md\nRoadmap as PDF: https://drive.google.com/file/d/180VbYNP537PDI8S8wpDiKqyncHotJTFI/view?usp=sharing\nSpecification documentation (tech stack): https://github.com/Sapient-Predictive-Analytics/Data-Driven_Catalyst/blob/main/OSDS.md\nDiscussion of Catalyst Stack changes (Catalyst Voices and Hermes) can be found here:\n  https://github.com/Sapient-Predictive-Analytics/Data-Driven_Catalyst/blob/main/Project_Catalyst.md#transition-to-in-house-  stack-catalyst-voices--hermes\nUse case sample: https://github.com/Sapient-Predictive-Analytics/Data-Driven_Catalyst/blob/main/Working_with_Fund_Data.md\nInventory of previously funded Catalyst projects to be relevant for the project (based on both our study of Voting Results files and voluntary contributions from community members): https://github.com/Sapient-Predictive-Analytics/Data-Driven_Catalyst/blob/main/Workshop/Inventory.md\nAI research and discussion: \n  https://github.com/Sapient-Predictive-Analytics/Data-Driven_Catalyst/blob/main/Using_AI.md\nDocumentation of community contact channels, collaborators and stakeholders contacted:\nPosted to our Developer Ecosystem and Catalyst Community Reviewers 157 members, Moderators, Advisors 1651 members:\nhttps://drive.google.com/file/d/1Ew8sMfVdyJ8tL8pjt4K9O7-p8ESsMHmC/view?usp=sharing\nHosted Breakout Room for AI- and ML-centric proposers and MR to discuss freely:\nhttps://drive.google.com/file/d/1fw6v7PcDL-scABgqTUxKUcpCGLcvAYcO/view?usp=sharing\nevent part of main community event central Townhall (Townhall#162, May 15th)\nhttps://www.youtube.com/live/IQcnGhLi7_Y?si=TeyWcNtj1RhJOer9\nCatalyst Head of Community Operations: Daniel Ribar, Telegram DM – agreed to partake in process\nCatalyst Voices & Hermes: Michael McNulty, Steven Johnson, Niels Kijf, Lucio Baglione – later milestones\nRepresentative Funded Proposers contacted for workshop M2 and agreed: Federico Weill for TxPipe\nCommunity Reviewers Channel link for reference: https://t.me/CatalystCommunityAdvisors\nIntersect Community: DM to Yuta @yutazzz, agreed to let us present to Japan and Eastern Townhall community, communication with @C3ETH (Eastern Townhall Indonesia) about “united front” on presenting AI to Catalyst.\nSee screenshots of communications in the following Chats.pdf file as well: \nhttps://drive.google.com/file/d/1NOdhFArzOeFWy4mjXvxFwNjU-8XBtcil/view?usp=sharing\nShared our Twitter handle on Github public repository, during Townhall and welcoming messages\nMore social media activity and larger workshop to occur as part of M2 as per SOM.\nGitbook presentation will become more meaningful close to Final Milestone release and community presentation, as the feedback and collaboration of the running project benefits greatly from being on Github to track contributions, contain interactive code, share data sets etc.\nhttps://sapient.gitbook.io/sapient/working_with_fund_data\nSubmitted at: May 21, 2024 at 2:12 PM\nProof of Achievement reviews\n2\napprovals\n0\nrefusals\nOpen Proof of Achievement reviews\nSignoff\nApproved by Catalyst Team sign off user on: May 27, 2024 at 3:41 PM\nShow archived Proofs of Achievement\nShow archived Milestone\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDiscussion\nProject Catalyst Milestone Module\nWebsite\nKnowledge Base\nPrivacy Policy\nFeedback\nChange Requests list"
}